<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"549be14d3983a6c9c0d9ee094ddefc356d987669291ace2ce012d74576b8f386","plan_job_ref":"Job Create MPE Management terraform plan #50 at https://github.com/AFMPE/mpe_management/actions/runs/7834059229","plan_hash":"07af873cae0c2313db8f9e686d5e4a8f75094bffbc2060346e2eeac246b53c69","plan_text_format":"trunc","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=ampev2            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
subscription_id_codex    = (sensitive value)
subscription_id_dev      = (sensitive value)
subscription_id_devlab   = (sensitive value)
subscription_id_forensic = (sensitive value)
subscription_id_hub      = (sensitive value)
subscription_id_identity = (sensitive value)
subscription_id_sandbox  = (sensitive value)
subscription_id_security = (sensitive value)
vm_admin_password        = (sensitive value)
```
</details>
<details>
<summary>Plan: 70 to add, 1 to change, 4 to destroy. Changes to Outputs.</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.ddos will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "ddos" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_ddos_protection_plan"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.nsg["default"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "default",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.nsg["private-endpoints"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "private-endpoints",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.nsg["vm"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "vm",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.rt will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "rt" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_route_table"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.snet["default"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "default",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.snet["private-endpoints"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "private-endpoints",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.snet["vm"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "vm",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.st will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "st" {
      + id            = (known after apply)
      + name          = "781aa40aa2"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.vnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurenoopsutils_resource_name.vnet_peering_hub will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vnet_peering_hub" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "devsecops"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_virtual_network_peering"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_devsecops_network.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_devsecops_network.data.azurerm_network_watcher.nwatcher will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_watcher" "nwatcher" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "NetworkWatcher_eastus"
      + resource_group_name = "NetworkWatcherRG"
      + tags                = (known after apply)
    }

  # module.mod_devsecops_network.data.azurerm_resource_group.netwatch will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "netwatch" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "NetworkWatcherRG"
      + tags       = (known after apply)
    }

  # module.mod_devsecops_network.data.azurerm_virtual_network.hub_vnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "hub_vnet" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "ampe-eus-hub-core-prod-vnet"
      + resource_group_name     = "ampe-eus-hub-core-prod-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_network_security_group.nsg["default"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Allow traffic from spokes"
              + destination_address_prefix                 = "10.8.7.0/24"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "22",
                  + "3389",
                  + "443",
                  + "80",
                ]
              + direction                                  = "Inbound"
              + name                                       = "Allow-Traffic-From-Spokes"
              + priority                                   = 200
              + protocol                                   = "*"
              + source_address_prefix                      = ""
              + source_address_prefixes                    = [
                  + "10.8.10.0/24",
                  + "10.8.6.0/24",
                  + "10.8.8.0/24",
                  + "10.8.9.0/24",
                ]
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "ResourceName" = "nsg_default"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "prod"
          + "workload"     = "devsecops"
        }
    }

  # module.mod_devsecops_network.azurerm_network_security_group.nsg["private-endpoints"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = (known after apply)
      + tags                = {
          + "ResourceName" = "nsg_private-endpoints"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "prod"
          + "workload"     = "devsecops"
        }
    }

  # module.mod_devsecops_network.azurerm_network_security_group.nsg["vm"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = (known after apply)
      + tags                = {
          + "ResourceName" = "nsg_vm"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "prod"
          + "workload"     = "devsecops"
        }
    }

  # module.mod_devsecops_network.azurerm_network_watcher_flow_log.nwflog["default"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flog-log-devsecops"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = "************************************"
          + workspace_region      = "eastus"
          + workspace_resource_id = "****************************************************************************************************************************************************************************************"
        }
    }

  # module.mod_devsecops_network.azurerm_network_watcher_flow_log.nwflog["private-endpoints"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flog-log-pe"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = "************************************"
          + workspace_region      = "eastus"
          + workspace_resource_id = "****************************************************************************************************************************************************************************************"
        }
    }

  # module.mod_devsecops_network.azurerm_network_watcher_flow_log.nwflog["vm"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flog-log-vm"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = "************************************"
          + workspace_region      = "eastus"
          + workspace_resource_id = "****************************************************************************************************************************************************************************************"
        }
    }

  # module.mod_devsecops_network.azurerm_role_assignment.dns["privatelink.vaultcore.azure.net"] will be created
  + resource "azurerm_role_assignment" "dns" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Private DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_role_assignment.peering will be created
  + resource "azurerm_role_assignment" "peering" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_route.force_internet_tunneling[0] will be created
  + resource "azurerm_route" "force_internet_tunneling" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = (known after apply)
      + next_hop_in_ip_address = "10.8.4.68"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = (known after apply)
      + route_table_name       = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_route_table.routetable will be created
  + resource "azurerm_route_table" "routetable" {
      + disable_bgp_route_propagation = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + resource_group_name           = (known after apply)
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "ResourceName" = "route-network-outbound"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "prod"
          + "workload"     = "devsecops"
        }
    }

  # module.mod_devsecops_network.azurerm_subnet.default_snet["default"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.8.7.224/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet.default_snet["private-endpoints"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.8.7.96/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet.default_snet["vm"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.8.7.64/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = [
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_network_security_group_association.nsgassoc["default"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_network_security_group_association.nsgassoc["private-endpoints"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_network_security_group_association.nsgassoc["vm"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_route_table_association.rtassoc["default"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_route_table_association.rtassoc["private-endpoints"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_subnet_route_table_association.rtassoc["vm"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_virtual_network.spoke_vnet will be created
  + resource "azurerm_virtual_network" "spoke_vnet" {
      + address_space       = [
          + "10.8.7.0/24",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # module.mod_devsecops_network.azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-ampe-eus-hub-core-prod-vnet-to-devsecops-spoke"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "ampe-eus-hub-core-prod-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "ampe-eus-hub-core-prod-vnet"
    }

  # module.mod_devsecops_network.azurerm_virtual_network_peering.spoke_to_hub will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-devsecops-spoke-to-ampe-eus-hub-core-prod-vnet"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = (known after apply)
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # module.mod_forensic_network.data.azurenoopsutils_resource_name.ddos will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "ddos" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "forensic"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_ddos_protection_plan"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_forensic_network.data.azurenoopsutils_resource_name.nsg["default"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "nsg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "forensic"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_security_group"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "default",
        ]
      + use_slug      = true
    }

  # module.mod_forensic_network.data.azurenoopsutils_resource_name.rt will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "rt" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "forensic"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_route_table"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_forensic_network.data.azurenoopsutils_resource_name.snet["default"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "snet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "forensic"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
          + "default",
        ]
      + use_slug      = true
    }

  # module.mod_forensic_network.data.azurenoopsutils_resource_name.st will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "st" {
      + id            = (known after apply)
      + name          = "f9ce3c18de"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_forensic_network.data.azurenoopsutils_resource_name.vnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "forensic"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_forensic_network.data.azurenoopsutils_resource_name.vnet_peering_hub will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "vnet_peering_hub" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "forensic"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_virtual_network_peering"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_forensic_network.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_forensic_network.data.azurerm_network_watcher.nwatcher will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_watcher" "nwatcher" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "NetworkWatcher_eastus"
      + resource_group_name = "NetworkWatcherRG"
      + tags                = (known after apply)
    }

  # module.mod_forensic_network.data.azurerm_resource_group.netwatch will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "netwatch" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "NetworkWatcherRG"
      + tags       = (known after apply)
    }

  # module.mod_forensic_network.data.azurerm_virtual_network.hub_vnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "hub_vnet" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "ampe-eus-hub-core-prod-vnet"
      + resource_group_name     = "ampe-eus-hub-core-prod-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.mod_forensic_network.azurerm_network_security_group.nsg["default"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Allow traffic from spokes"
              + destination_address_prefix                 = "10.8.10.0/24"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "22",
                  + "3389",
                  + "443",
                  + "80",
                ]
              + direction                                  = "Inbound"
              + name                                       = "Allow-Traffic-From-Spokes"
              + priority                                   = 200
              + protocol                                   = "*"
              + source_address_prefix                      = ""
              + source_address_prefixes                    = [
                  + "10.8.6.0/24",
                  + "10.8.7.0/24",
                  + "10.8.8.0/24",
                  + "10.8.9.0/24",
                ]
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "ResourceName" = "nsg_default"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "prod"
          + "workload"     = "forensic"
        }
    }

  # module.mod_forensic_network.azurerm_network_watcher_flow_log.nwflog["default"] will be created
  + resource "azurerm_network_watcher_flow_log" "nwflog" {
      + enabled                   = true
      + id                        = (known after apply)
      + location                  = (known after apply)
      + name                      = "network-watcher-flog-log-forensic"
      + network_security_group_id = (known after apply)
      + network_watcher_name      = "NetworkWatcher_eastus"
      + resource_group_name       = "NetworkWatcherRG"
      + storage_account_id        = (known after apply)
      + version                   = 2

      + retention_policy {
          + days    = 0
          + enabled = true
        }

      + traffic_analytics {
          + enabled               = true
          + interval_in_minutes   = 10
          + workspace_id          = "************************************"
          + workspace_region      = "eastus"
          + workspace_resource_id = "****************************************************************************************************************************************************************************************"
        }
    }

  # module.mod_forensic_network.azurerm_role_assignment.peering will be created
  + resource "azurerm_role_assignment" "peering" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.mod_forensic_network.azurerm_route.force_internet_tunneling[0] will be created
  + resource "azurerm_route" "force_internet_tunneling" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = (known after apply)
      + next_hop_in_ip_address = "10.8.4.68"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = (known after apply)
      + route_table_name       = (known after apply)
    }

  # module.mod_forensic_network.azurerm_route_table.routetable will be created
  + resource "azurerm_route_table" "routetable" {
      + disable_bgp_route_propagation = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + resource_group_name           = (known after apply)
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "ResourceName" = "route-network-outbound"
          + "deployedBy"   = "AzureNoOpsTF"
          + "env"          = "prod"
          + "workload"     = "forensic"
        }
    }

  # module.mod_forensic_network.azurerm_subnet.default_snet["default"] will be created
  + resource "azurerm_subnet" "default_snet" {
      + address_prefixes                               = [
          + "10.8.10.224/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = (known after apply)
    }

  # module.mod_forensic_network.azurerm_subnet_network_security_group_association.nsgassoc["default"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsgassoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.mod_forensic_network.azurerm_subnet_route_table_association.rtassoc["default"] will be created
  + resource "azurerm_subnet_route_table_association" "rtassoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.mod_forensic_network.azurerm_virtual_network.spoke_vnet will be created
  + resource "azurerm_virtual_network" "spoke_vnet" {
      + address_space       = [
          + "10.8.10.0/24",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # module.mod_forensic_network.azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-ampe-eus-hub-core-prod-vnet-to-forensic-spoke"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "ampe-eus-hub-core-prod-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "ampe-eus-hub-core-prod-vnet"
    }

  # module.mod_forensic_network.azurerm_virtual_network_peering.spoke_to_hub will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering-forensic-spoke-to-ampe-eus-hub-core-prod-vnet"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = (known after apply)
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # module.mod_hub_network.azurerm_firewall.fw[0] will be updated in-place
  ~ resource "azurerm_firewall" "fw" {
      ~ firewall_policy_id  = "************************************************************************************************************************************************************************************" -> (known after apply)
        id                  = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/azureFirewalls/ampe-eus-hub-core-prod-fw"
        name                = "ampe-eus-hub-core-prod-fw"
        tags                = {
            "ResourceName" = "ampe-eus-hub-core-prod-fw"
            "deployedBy"   = "AzureNoOpsTF"
            "env"          = "prod"
            "workload"     = "hub-core"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.mod_hub_network.azurerm_firewall_policy.firewallpolicy must be replaced
-/+ resource "azurerm_firewall_policy" "firewallpolicy" {
      - auto_learn_private_ranges_enabled = false -> null
      ~ child_policies                    = [] -> (known after apply)
      ~ firewalls                         = [] -> (known after apply)
      ~ id                                = "*********************************************************************************************************************************************************************" -> (known after apply)
        name                              = "ampe-eus-hub-core-prod-afwp"
      - private_ip_ranges                 = [] -> null
      ~ rule_collection_groups            = [
          - "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/firewallPolicies/ampe-eus-hub-core-prod-afwp/ruleCollectionGroups/ampe-eus-hub-core-prod-afwp-default-nwrcg",
          - "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/firewallPolicies/ampe-eus-hub-core-prod-afwp/ruleCollectionGroups/ampe-eus-hub-core-prod-afwp-default-arcg",
          - "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/firewallPolicies/ampe-eus-hub-core-prod-afwp/ruleCollectionGroups/ampe-eus-hub-core-prod-afwp-default-natrcg",
        ] -> (known after apply)
      ~ sku                               = "Standard" -> "Premium" # forces replacement
      - tags                              = {} -> null
        # (3 unchanged attributes hidden)

      + intrusion_detection {
          + mode = "Alert"
        }
    }

  # module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.app_rule_collection_group must be replaced
-/+ resource "azurerm_firewall_policy_rule_collection_group" "app_rule_collection_group" {
      ~ firewall_policy_id = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/firewallPolicies/ampe-eus-hub-core-prod-afwp" # forces replacement -> (known after apply) # forces replacement
      ~ id                 = "***********************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name               = "ampe-eus-hub-core-prod-afwp-default-arcg"
        # (1 unchanged attribute hidden)

      ~ application_rule_collection {
            name     = "AzureAuth"
            # (2 unchanged attributes hidden)

          ~ rule {
              - destination_addresses = [] -> null
              - destination_fqdn_tags = [] -> null
              - destination_urls      = [] -> null
                name                  = "msftauth"
              - source_ip_groups      = [] -> null
              - terminate_tls         = false -> null
              - web_categories        = [] -> null
                # (2 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }
        }
      ~ application_rule_collection {
            name     = "AppServiceEnvironment"
            # (2 unchanged attributes hidden)

          ~ rule {
              - destination_addresses = [] -> null
              - destination_fqdn_tags = [] -> null
              - destination_urls      = [] -> null
                name                  = "AppServiceEnvironment"
              - source_ip_groups      = [] -> null
              - terminate_tls         = false -> null
              - web_categories        = [] -> null
                # (2 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }
        }
    }

  # module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.nat_rule_collection_group must be replaced
-/+ resource "azurerm_firewall_policy_rule_collection_group" "nat_rule_collection_group" {
      ~ firewall_policy_id = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/firewallPolicies/ampe-eus-hub-core-prod-afwp" # forces replacement -> (known after apply) # forces replacement
      ~ id                 = "*************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name               = "ampe-eus-hub-core-prod-afwp-default-natrcg"
        # (1 unchanged attribute hidden)
    }

  # module.mod_hub_network.azurerm_firewall_policy_rule_collection_group.nw_rule_collection_group must be replaced
-/+ resource "azurerm_firewall_policy_rule_collection_group" "nw_rule_collection_group" {
      ~ firewall_policy_id = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-hub-core-prod-rg/providers/Microsoft.Network/firewallPolicies/ampe-eus-hub-core-prod-afwp" # forces replacement -> (known after apply) # forces replacement
      ~ id                 = "************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name               = "ampe-eus-hub-core-prod-afwp-default-nwrcg"
        # (1 unchanged attribute hidden)

      ~ network_rule_collection {
            name     = "AllowAzureCloud"
            # (2 unchanged attributes hidden)

          ~ rule {
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
                name                  = "AzureCloud"
              - source_ip_groups      = [] -> null
                # (4 unchanged attributes hidden)
            }
        }
      ~ network_rule_collection {
            name     = "AppServiceEnvironment"
            # (2 unchanged attributes hidden)

          ~ rule {
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
                name                  = "NTP"
              - source_ip_groups      = [] -> null
                # (4 unchanged attributes hidden)
            }
        }
      ~ network_rule_collection {
            name     = "AzureMonitor"
            # (2 unchanged attributes hidden)

          ~ rule {
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
                name                  = "AzureMonitor"
              - source_ip_groups      = [] -> null
                # (4 unchanged attributes hidden)
            }
        }
      ~ network_rule_collection {
            name     = "AllowTrafficBetweenSpokes"
            # (2 unchanged attributes hidden)

          ~ rule {
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
                name                  = "AllSpokeTraffic"
              - source_ip_groups      = [] -> null
                # (4 unchanged attributes hidden)
            }
        }
      ~ network_rule_collection {
            name     = "AllowTrafficForACAS"
            # (2 unchanged attributes hidden)

          ~ rule {
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
                name                  = "AllACASTraffic"
              - source_ip_groups      = [] -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # module.mod_id_network.data.azurenoopsutils_resource_name.ddos will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurenoopsutils_resource_name" "ddos" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "id"
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_network_ddos_protection_plan"
      + result        = (known after apply)
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #50](https://github.com/AFMPE/mpe_management/actions/runs/7834059229)